{
    "appChangelog": {
        "v0.7.x": {
            "Overview": "v0.7.x adds password protection and the ability to choose which familyTreeData to start with, plus a basic notification system.",
            "Changes": [
                "Added a modal dialog to choose between new tree, example tree, and load tree",
                "Added password protection",
                "Added NotificationBanner and SaveStateBanner"
            ]
        },
        "v0.6.x": {
            "Overview": "v0.6.x adds the ability to read and write the familyTreeData store to a private GitHub repo.",
            "Changes": [
                "Added the ability to decrypt a PAT to communicate with GitHub",
                "Added the ability to read the contents of a file from GitHub",
                "Added the ability to write the contens of a json file on GitHub",
                "Refactored StoreView into DevTools"
            ]
        },
        "v0.5.x": {
            "Overview": "v0.5.x adds the ability to read and write from the familyTreeData store.",
            "Changes": [
                "Hooked up UI to familyTreeData store"
            ]
        },
        "v0.4.x": {
            "Overview": "v0.4.x adds the ability to read and write from the familyTreeData store.",
            "Changes": [
                "Hooked up UI to familyTreeData store"
            ]
        },
        "v0.3.x": {
            "Overview": "v0.3.x adds interactivity via clicking the add person button and clicking on a PersonNode to set the active person.",
            "Changes": [
                "Added a button to add a new person",
                "Added the ability to click on a PersonNode to set the active person"
            ]
        },
        "v0.2.x": {
            "Overview": "v0.2.x introduces the GenerationRow and improves the interface by centering major elements horizontally and vertically.",
            "Changes": [
                "Created the GenerationRow component",
                "Determined how to center GenerationRows vertically and their contents horizontally"
            ]
        },
        "v0.1.x": {
            "Overview": "v0.1.x adds a basic PersonNode element.",
            "Changes": [
                "Created initial PersonNode element",
                "Created initial styles"
            ]
        },
        "v0.0.x": {
            "Overview": "v0.0.x represents the initial attempt at creating a very basic interface for the Family Tree app.",
            "Changes": [
                "Initialized repo and Svelte project",
                "Created initial UI framework"
            ]
        }
    },
    "dataChangelog": {
        "v0.9.x": {
            "Overview": "v0.9.x wraps up the initial supported relationship list with the addition of aunts, uncles, nieces, nephews (and great aunts, nieces, etc.) plus second cousins and spouse siblings.",
            "Changes": [
                "Added support for aunts, uncles, great aunts, great uncles, nieces, nephews, great nieces, great nephews, cousins, second cousins, and spouse stepsiblings."
            ]
        },
        "v0.8.x": {
            "Overview": "v0.8.x makes additional changes as required to support filtering the available people list via text box.",
            "Changes": [
                "Made changes as required to support available people filtering."
            ]
        },
        "v0.7.x": {
            "Overview": "v0.7.x makes changes as required to support filtering the available people list via text box.",
            "Changes": [
                "Made changes as required to support available people filtering."
            ]
        },
        "v0.6.x": {
            "Overview": "v0.6.x organizes and refactors the ability to get inverse relationships.",
            "Changes": [
                "Organized and refactored the logic to get inverse relationship IDs."
            ]
        },
        "v0.5.x": {
            "Overview": "v0.5.x updates relationshipMap to use friendly names for relationshipIDs instead of UUIDs.",
            "Changes": [
                "Changed relationship IDs to friendly names instead of UUIDs"
            ]
        },
        "v0.4.x": {
            "Overview": "v0.4.x moves stepsiblings and children-in-law into a proper grouping to match preferred organization.",
            "Changes": [
                "Moved stepsiblings and children-in-law into their own relationship group."
            ]
        },
        "v0.2.x": {
            "Overview": "v0.2.x splits the relationshipMap data into its own separate object.",
            "Changes": [
                "Split relationshipMap from familyTreeData",
                "Added UUID support for relationshipIDs"
            ]
        },
        "v0.1.x": {
            "Overview": "v0.1.x adds initial support for inverse relationship types.",
            "Changes": [
                "Added inverse relationships for all relationships."
            ]
        }
    }
}